fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьНаСервере(ДатаНачала, ДатаОкончания, ВыходныеДни, График, ДанныеСайта = Ложь) Экспорт

	Если Не ДанныеСайта Тогда
		ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, График);
		Возврат;
	КонецЕсли;
	
	СписокГодовыхПериодов = СписокГодовыхПериодов(ДатаНачала, ДатаОкончания);
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение("isdayoff.ru", , , , , , ЗащищенноеСоединение, );
	ВсеСимволы = Новый Массив;
	
	ПараметрШестидневки = 0;
	Если График = Справочники.ВКМ_ГрафикиРаботы.Шестидневка Тогда
		ПараметрШестидневки = 1;
	КонецЕсли;
	
	Для Каждого Период Из СписокГодовыхПериодов Цикл
		
		АдресРесурса = СтрШаблон("/api/getdata?date1=%1&date2=%2&sd=%3", 
			Формат(Период.ДатаНачала, "ДФ=ггггММдд;"), 
			Формат(Период.ДатаОкончания, "ДФ=ггггММдд;"),
			ПараметрШестидневки);
	
		Запрос = Новый HTTPЗапрос(АдресРесурса); 
	
		Попытка
			Ответ = Соединение.Получить(Запрос);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;	
			
		Если Ответ.КодСостояния = 200 Тогда
			ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
			ВсеСимволы.Добавить(ТекстОтвета);	
		Иначе
			ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
			ТекстСообщения = СтрШаблон("%1 Ошибка: %2", ТекстОтвета, Ответ.КодСостояния);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ВсеСимволы = СтрСоединить(ВсеСимволы, "");
	ЗаполнитьГрафикИзДанныхСайта(ДатаНачала, ДатаОкончания, График, ВсеСимволы);
	
КонецПроцедуры

Функция СписокГодовыхПериодов(Знач ДатаНачала, Знач ДатаОкончания)

	СписокГодовыхПериодов = Новый Массив;
	
	Пока ДатаНачала < ДатаОкончания Цикл
		
		Период = Новый СтандартныйПериод();
		Период.ДатаНачала = ДатаНачала;
		ДатаОкончанияПериода = КонецГода(ДатаНачала);
		
		Если ДатаОкончанияПериода < ДатаОкончания Тогда
			Период.ДатаОкончания = ДатаОкончанияПериода;
		Иначе
			Период.ДатаОкончания = ДатаОкончания;
			СписокГодовыхПериодов.Добавить(Период);
			Прервать;
		КонецЕсли;
		
		СписокГодовыхПериодов.Добавить(Период);
		ДатаНачала = ДатаОкончанияПериода + 86400;
		
	КонецЦикла;
	
	Возврат СписокГодовыхПериодов;
	
КонецФункции

Процедура ЗаполнитьГрафикИзДанныхСайта(Знач ДатаНачала, Знач ДатаОкончания, График, ВсеСимволы)
	
	НаборЗаписей = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГрафикРаботы.Установить(График);
	НаборЗаписей.Записать();
	НомерСимвола = 1;
	
	Пока ДатаНачала < ДатаОкончания Цикл
	
		Символ = Число(Сред(ВсеСимволы, НомерСимвола, 1));
		
		Если Символ = 0 Тогда
			Значение = 1;
		ИначеЕсли Символ = 1 Тогда
			Значение = 0;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Дата = ДатаНачала;
		НоваяЗапись.ГрафикРаботы = График;
		НоваяЗапись.Значение = Значение;
		
		ДатаНачала = ДатаНачала + 86400;
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, График)
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(График);
	Набор.Записать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.Значение = 0;
			Иначе	          
				Запись.Значение = 8;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ГрафикРаботы = График;
				НоваяЗапись.Дата = Дат;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.Значение = 0;
				Иначе	          
					НоваяЗапись.Значение = 8;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.Значение = 0;
				Иначе	          
					Запись.Значение = 8;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ГрафикРаботы = График;
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.Значение = 0;
		Иначе	          
			Запись.Значение = 8;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
	
КонецПроцедуры

#КонецЕсли
